#!/bin/bash

# Colors
YELLOW='\033[1;33m'
CYAN='\033[1;36m'
GREEN='\033[1;32m'
MAGENTA='\033[1;35m'
RESET='\033[0m'

# ╔══════════════════════════════════════════════════════╗
# ║ 🔄 Restoring mamar_bank_db with a sprinkle of magic! ✨ ║
# ╚══════════════════════════════════════════════════════╝


echo -e "${CYAN}╔════════════════════════════════════════════════════════════════════════╗"
echo -e "║ 🔄 ${YELLOW}Starting to restore mamar_bank_db from dump.sql...${CYAN} 🚀                 ║"
echo -e "║    ${MAGENTA}Restoring every byte with love and care. 🐢💖                      ${CYAN}║"
echo -e "╚════════════════════════════════════════════════════════════════════════╝${RESET}"
echo ""

sh ./scripts/clear_database.sh

docker exec -i postgres psql -U postgres -d mamar_bank_db < dump.sql

echo -e "\n\n\n"
echo -e "${GREEN}╔════════════════════════════════════════════════════════════════════════╗"
echo -e "║ 🎉 Restore complete! ${YELLOW}mamar_bank_db is back in action!${GREEN} ✨💕               ║"
echo -e "╚════════════════════════════════════════════════════════════════════════╝${RESET}"